# Реализовать функцию int_func(), принимающую слова из маленьких латинских букв
# и возвращающую их же, но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.

def mfunc(*args):
    mtext = input('Please enter a short text: ')
    print(mtext.title())
    return


mfunc()

